# Pandas basic

# Questin-1- Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

Answeer-1-

In [3]:
import pandas as pd

In [4]:
data = [4, 8, 15, 16, 23, 42]

In [5]:
series = pd.Series(data)

In [7]:
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Question-2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

# Answer-2-

In [8]:
l = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [9]:
my_series = pd.Series(l)

In [10]:
print(my_series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:
name=alice,bob,claire
Age= 25,30,27
Gender=Female,Male,Female

Then, print the DataFrame.

In [11]:
data2 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 27],
    'Gender': ['female','male','female']}

In [12]:
df = pd.DataFrame(data2)

In [13]:
print(df)

      Name  Age  Gender
0    Alice   25  female
1      Bob   30    male
2  Charlie   27  female

# Question-4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# Answer-4- In pandas, a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns). It is essentially a table with rows and columns, where each column can have a different data type.

# A Pandas Series is a one-dimensional labeled array capable of holding any data type. It is like a single column of data in a table or a one-dimensional array. A DataFrame is essentially a collection of Series objects with a shared index.

In [14]:
ser = pd.Series([10, 20, 30, 40, 50], name='MySeries')

In [15]:
print(ser)

0    10
1    20
2    30
3    40
4    50
Name: MySeries, dtype: int64

In [17]:
# pandas series
data3 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]}

In [18]:
df = pd.DataFrame(data3)

In [19]:
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

# answer-5- like head and tail

In [20]:
df.head()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [21]:
df.tail()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [22]:
df.info

<bound method DataFrame.info of       Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35>

In [23]:
df.describe

<bound method NDFrame.describe of       Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35>

# Question-6. Which of the following is mutable in nature Series, DataFrame, Panel?

# Answer-6-
# Series: A Pandas Series is a one-dimensional labeled array and is mutable, meaning you can modify the elements after creation.

# DataFrame: A Pandas DataFrame is a two-dimensional labeled data structure and is also mutable. You can modify the data, add or remove columns, change column names, etc.

# Panel: Panels were a three-dimensional data structure in older versions of Pandas, but they have been removed in recent versions (from 0.25.0, July 2019). As of the current versions of Pandas, the recommended way to handle three-dimensional data is to use a MultiIndex DataFrame.

# Question-7. Create a DataFrame using multiple Series. Explain with an example.

In [24]:
series1 = pd.Series([10, 20, 30, 40], name='Series1')
series2 = pd.Series(['a', 'b', 'c', 'd'], name='Series2')

In [25]:
df = pd.DataFrame({series1.name: series1, series2.name: series2})

In [26]:
print(df)

   Series1 Series2
0       10       a
1       20       b
2       30       c
3       40       d

# assignment completed